In [1]:
# importing libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [2]:
df = pd.read_csv('CAR DETAILS FROM CAR DEKHO.csv')
df.head()

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner

In [3]:
df.describe()

              year  selling_price      km_driven
count  4340.000000   4.340000e+03    4340.000000
mean   2013.090783   5.041273e+05   66215.777419
std       4.215344   5.785487e+05   46644.102194
min    1992.000000   2.000000e+04       1.000000
25%    2011.000000   2.087498e+05   35000.000000
50%    2014.000000   3.500000e+05   60000.000000
75%    2016.000000   6.000000e+05   90000.000000
max    2020.000000   8.900000e+06  806599.000000

In [4]:
# removing unique identifier coloumn
print(f'shape before dropping unique identifier {df.shape}')
df.drop('name',inplace=True,axis=1)
print(f'shape afte dropping {df.shape}')

shape before dropping unique identifier (4340, 8)
shape afte dropping (4340, 7)

In [5]:
df.head()

,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,2014,450000,141000,Diesel,Individual,Manual,Second Owner

In [6]:
df.columns

Index(['year', 'selling_price', 'km_driven', 'fuel', 'seller_type',
       'transmission', 'owner'],
      dtype='object')

In [7]:
df.fuel.value_counts()/len(df.fuel)*100

Diesel      49.608295
Petrol      48.917051
CNG          0.921659
LPG          0.529954
Electric     0.023041
Name: fuel, dtype: float64

##### since this is a prediction problem we should not remove categories with less frequency so we will convert CNG,LPG,Electric to others

In [8]:
df.fuel.replace(['CNG','LPG','Electric'],'others',inplace=True)

In [9]:
df.fuel.value_counts()

Diesel    2153
Petrol    2123
others      64
Name: fuel, dtype: int64

In [11]:
df.head()

,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,2014,450000,141000,Diesel,Individual,Manual,Second Owner

In [16]:
df_fuel = df.fuel.map({'Petrol':0,'Diesel':1,'others':2})
df_fuel.head()

0    0
1    0
2    1
3    0
4    1
Name: fuel, dtype: int64

In [20]:
df.drop('fuel',inplace=True,axis=1)

In [21]:
df.head()

   year  selling_price  km_driven seller_type transmission         owner
0  2007          60000      70000  Individual       Manual   First Owner
1  2007         135000      50000  Individual       Manual   First Owner
2  2012         600000     100000  Individual       Manual   First Owner
3  2017         250000      46000  Individual       Manual   First Owner
4  2014         450000     141000  Individual       Manual  Second Owner

In [22]:
data = pd.concat([df,df_fuel],axis=1)

In [25]:
data.head()

   year  selling_price  km_driven seller_type transmission         owner  fuel
0  2007          60000      70000  Individual       Manual   First Owner     0
1  2007         135000      50000  Individual       Manual   First Owner     0
2  2012         600000     100000  Individual       Manual   First Owner     1
3  2017         250000      46000  Individual       Manual   First Owner     0
4  2014         450000     141000  Individual       Manual  Second Owner     1